{
  "Introduction": {
    "title": "Java Introduction",
    "body": "<p><b><span style='color:red;'>Q: What is Java?</span></b><br/><b>Ans:</b> Java is a high-level, object-oriented, platform-independent programming language which achieves platform independence using bytecode and JVM.<br/>• Here high level means the language which is easy to read and write also hide hardware level details <br/><br/><b><span style='color:red;'>Q: What is the difference between JDK, JRE, and JVM?</span></b><br/><b>Ans</b><button class='audio-control' onclick='playAudio(this)'>▶</button><audio class='qAudio' src='https://raw.githubusercontent.com/syedmubeencode/web-resources/main/Study/jdk_test.m4a'></audio>:<br/>• <b>JDK:</b> JDK is a complete package required to develop Java applications. Where a JDK contains below items.<br/>• <b>JRE:</b> Environment for running applications (includes libraries and JVM).<br/>• <b>JVM:</b> JVM is a virtual machine like minicomputer that executes Java bytecode then JVM use interpreter to execute bytecode line by line to machine code. Before that compiler convert source code to bytecode.<br/><br/><b><span style='color:red;'>Q: What is a compiler and an interpreter?</span></b><br/><b>Ans:</b> The compiler converts Java source code into bytecode also A compiler translates the entire code at once (faster execution), Interpreter executes bytecode line by line also interpreter translates line-by-line (easier debugging). Java uses a compiler to create bytecode and the JVM to interpret/compile it at runtime.<br/><br/><b><span style='color:red;'>Q: Is the JIT compiler different from the regular compiler?</span></b><br/><b>Ans:</b> Yes. The regular compiler (javac) creates bytecode before execution. The Just-In-Time (JIT) compiler converts bytecode to native machine code during runtime to improve performance.<br/><br/><b><span style='color:red;'>Q: Explain Java's platform independence.</span></b><br/><b>Ans:</b> Java compiles source code into platform-neutral bytecode (.class files). Any system with a JVM can execute this bytecode, regardless of the underlying hardware or OS.<br/><br/><b><span style='color:red;'>Q: What is bytecode in Java?</span></b><br/><b>Ans:</b> Bytecode is a machine-independent instruction set contained in .class files. It serves as the intermediate step between Java source code and machine-specific code, executed only by the JVM.</p>"
  },
  "Theory": {
    "title": "Java Theory",
    "body": "<p>Java is an object-oriented programming language designed for flexibility and performance.</p>"
  },
  "Practical": {
    "title": "Java — Practical",
    "body": "<p>Hands-on: use IDEs, build tools (Maven/Gradle), test with JUnit.</p>"
  },
  "Interview Questions": {
    "title": "Java — Interview Questions",
    "body": "<p>Q: What is JVM? <br/>A: JVM executes bytecode and provides platform independence.</p>"
  },
  "Code Examples": {
    "title": "Java — Code Examples",
    "body": "<p>Example: Stream API</p>"
  }
}
