{
  "Introduction": {
    "title": "Java Introduction",
    "body": "<p><b><span style='color:red;'>Q:What is Java?</span></b><br/><b> Ans : </b><button class='audio-control' onclick='playAudio(this)'>▶</button><audio class='qAudio' src='https://raw.githubusercontent.com/syedmubeencode/web-resources/main/Study/jdk_test.m4a'/>Java is a high-level, object oriented programming language developed by Sun Microsystems that enables the development of platform independent applications.<br/><br/><b><span style='color:red;'>Q:What is the difference between JDK, JRE and JVM?</span></b><br/><b> Ans : </b>Java Development Kit (JDK) is used by developers for creating Java applications and includes the necessary tools, libraries, and compilers. <br/>Java Runtime Environment : is used by end-Users to run java applications and provides the runtime environments and essential class libraries but does not include development tools like JDK. <br/>Java virtual machine : is mini-computer inside your computer It handles memory management, garbage collection, and just-in-time (JIT) compilation, converting bytecode into native machine code and this makes java platform-independent.<br/><br/><b><span style='color:red;'>Q: What is a compiler and interpreter?</span></b><br/><b>Ans:</b> A compiler translates the entire source code into machine code at once, creating an executable file that runs faster. An interpreter, on the other hand, translates and executes the code line by line, making it easier to debug but slower in execution. In Java, the compiler converts code to bytecode, and the JVM interpreter executes it.<br/><br/><b><span style='color:red;'>Q: Is Just-In-Time (JIT) compiler and compiler different? If not, then what are those?</span></b><br/><b>Ans:</b> The regular compiler converts Java source code into bytecode, which the JVM can understand. The Just-In-Time (JIT) compiler, part of the JVM, further converts this bytecode into native machine code at runtime to boost performance. So, both are compilers but work at different stages — one before execution and the other during execution.<br/><br/><b><span style='color:red;'>Q: JVM is platform independent where JDK is not — please explain?</span></b><br/><b>Ans:</b> Java's most unique feature is its platform independence. Unlike other languages that compile source code into platform-specific executables, Java compiles code into .class files containing bytecode. This bytecode is interpreted by the Java Virtual Machine (JVM), which is available on all major platforms. As a result, Java code compiled on Windows can run on Linux or any other platform with a JVM.<br/><br/><b><span style='color:red;'>Q: What is bytecode in Java?</span></b><br/><b>Ans:</b> When a javac compiler compiles a class, it generates a .class file. This .class file contains a set of instructions called bytecode. Bytecode is a machine-independent language and contains instructions that are executed only by the JVM. The JVM can understand and execute these bytecodes.<br/><br/></p>"
  },
  "Theory": {
    "title": "Java Theory",
    "body": "<p>Java is an object-oriented programming language designed for flexibility and performance. <button class='audio-control' onclick='playAudio(this)'>▶</button><audio class='qAudio' src='https://raw.githubusercontent.com/syedmubeencode/web-resources/main/Study/jdk_test.m4a'/></p>"
  },
  "Practical": {
    "title": "Java — Practical",
    "body": "<p>Hands-on: use IDEs, build tools (Maven/Gradle), test with JUnit.</p>"
  },
  "Interview Questions": {
    "title": "Java — Interview Questions",
    "body": "<p>Q: What is JVM? <br/>A: JVM executes bytecode and provides platform independence.</p>"
  },
  "Code Examples": {
    "title": "Java — Code Examples",
    "body": "<p>Example: Stream API</p>"
  }
}