{
  "Introduction": {
    "title": "Java Introduction",
    "body": "<p><b><span style='color:red;'>Q: What is Java?</span></b>


<b>Ans:</b> Java is a high-level, object-oriented, platform-independent programming language which achieves platform independence using bytecode and JVM.


• Here high level means the language which is easy to read and write also hide hardware level details.



<b><span style='color:red;'>Q: What is the JDK (Java Development Kit)?</span></b>


<b>Ans:</b> JDK is a complete package required to develop Java applications. Without the JDK, you cannot compile Java code.


• <b>JDK contains:</b> JRE, JVM, Java Compiler (javac), Debugger, JavaDoc, and other development tools.



<b><span style='color:red;'>Q: What is the JRE (Java Runtime Environment)?</span></b>


<b>Ans:</b> JRE provides the environment to run Java programs. It is what you need if you only want to execute Java applications rather than develop them.


• <b>JRE contains:</b> JVM, Core Java libraries, and supporting files.



<b><span style='color:red;'>Q: What is the JVM (Java Virtual Machine)?</span></b>


<b>Ans:</b> JVM is a virtual machine (like a minicomputer) that executes Java bytecode. It uses an interpreter to execute bytecode line-by-line into machine code.


• <b>Note:</b> Bytecode is platform-independent, which makes Java platform-independent; however, the JVM itself is platform-dependent.


• <b>Responsibilities:</b> Loads class files, verifies bytecode, manages memory (Garbage Collection), and handles thread execution.



<b><span style='color:red;'>Q: Explain the Java Compilation Process.</span></b>


<b>Ans:</b> The execution flow follows a specific path to ensure portability:


1. <b>Source Code (.java):</b> Written by the developer.


2. <b>Compiler (javac):</b> Converts source code into Bytecode.


3. <b>Bytecode (.class):</b> Platform-independent intermediate code.


4. <b>JVM:</b> Executes the bytecode on the specific OS to produce Machine Code.



<b><span style='color:red;'>Q: What is the difference between the Compiler and the Interpreter in Java?</span></b>


<b>Ans:</b> Java uses both to balance portability and speed.


• <b>Compiler (javac):</b> Runs before execution and converts source code into platform-neutral bytecode. It does not produce machine code directly.


• <b>Interpreter:</b> Executes bytecode line-by-line inside the JVM. It allows for easier debugging but has slower execution compared to native code.



<b><span style='color:red;'>Q: What is the JIT (Just-In-Time) Compiler?</span></b>


<b>Ans:</b> JIT is a part of the JVM that improves performance by converting frequently used bytecode into native machine code during runtime. This avoids repeated interpretation and allows Java to run almost as fast as C/C++.



<b><span style='color:red;'>Q: What are the internal components of the JVM?</span></b>


<b>Ans:</b> The JVM is divided into several functional areas:


• <b>Class Loader:</b> Loads the .class files.


• <b>Runtime Data Areas:</b> Includes the Heap (objects), Stack (methods/variables), and Method Area.


• <b>Execution Engine:</b> Contains the Interpreter, JIT Compiler, and Garbage Collector.



<b><span style='color:red;'>Q: Summary Table: JDK vs. JRE vs. JVM</span></b>


<table border='1' style='border-collapse: collapse; width: 100%;'> <tr> <th style='padding: 8px; background-color: #f2f2f2;'>Component</th> <th style='padding: 8px; background-color: #f2f2f2;'>Purpose</th> </tr> <tr> <td style='padding: 8px;'><b>JDK</b></td> <td style='padding: 8px;'>Develop + Compile + Run Java applications.</td> </tr> <tr> <td style='padding: 8px;'><b>JRE</b></td> <td style='padding: 8px;'>Environment to Run Java apps (Libraries + JVM).</td> </tr> <tr> <td style='padding: 8px;'><b>JVM</b></td> <td style='padding: 8px;'>Executes Bytecode on a specific platform.</td> </tr> <tr> <td style='padding: 8px;'><b>Compiler</b></td> <td style='padding: 8px;'>Converts Source Code → Bytecode.</td> </tr> <tr> <td style='padding: 8px;'><b>Interpreter</b></td> <td style='padding: 8px;'>Executes Bytecode line-by-line.</td> </tr> <tr> <td style='padding: 8px;'><b>JIT</b></td> <td style='padding: 8px;'>Optimizes performance during runtime.</td> </tr> </table>


<b><span style='color:red;'>Q: Interview-ready 3-line Summary?</span></b>


<b>Ans:</b> JDK is used for development and includes JRE and the compiler. JRE provides the libraries and JVM required to run Java programs. JVM executes bytecode using an interpreter and JIT to achieve both platform independence and high performance.</p>"
  },
  "Theory": {
    "title": "Java Theory",
    "body": "<p>Java is an object-oriented programming language designed for flexibility and performance.</p>"
  },
  "Practical": {
    "title": "Java — Practical",
    "body": "<p>Hands-on: use IDEs, build tools (Maven/Gradle), test with JUnit.</p>"
  },
  "Interview Questions": {
    "title": "Java — Interview Questions",
    "body": "<p>Q: What is JVM? <br/>A: JVM executes bytecode and provides platform independence.</p>"
  },
  "Code Examples": {
    "title": "Java — Code Examples",
    "body": "<p>Example: Stream API</p>"
  }
}
